// ==UserScript==
// @name         3D坦克资源替换
// @namespace    http://tampermonkey.net/
// @version      1.2_Beta_5
// @description  替换3D坦克炮塔、底盘、无人机皮肤、节日装饰品、迷彩、射击效果等资源
// @author       Testanki
// @match        *://*.3dtank.com/play*
// @match        *://*.tankionline.com/play*
// @match        *://*.test-eu.tankionline.com/*
// @match        *://*.test-ru.tankionline.com/*
// @grant        none
// ==/UserScript==

(function() {
	'use strict';
	const currentVersionCode = 12;
	const versionUrl = 'https://testanki1.github.io/models/version.json';

	fetch(versionUrl)
		.then(response => {
			if (!response.ok) throw new Error('网络错误');
			return response.json();
		})
		.then(data => {
			const latestVersion = data.version;
			const latestVersionCode = data.version_code;
			const updateInfo = data.update_info;
			const downloadUrl = data.download_url;

			if (latestVersionCode > currentVersionCode) {
				const message = `
                    资源替换脚本有新版本可用！
                    最新版本：${latestVersion}
                    更新内容：${updateInfo}
                `;
				if (confirm(message + "点击确定下载新版本？")) {
					window.location.href = downloadUrl;
				}
			}
		})
		.catch(error => {
			console.error('更新检查失败:', error);
		});

	const currentUrl = window.location.href;
	const turretsRedirectMap = {
		"firebird": {
			"default": "573/113511/153/137/31167700271626",
			"XT": "0/16722/167/100/31033604530020",
			"LC": "606/154706/226/46/31033604523453",
			"DC": "574/111547/344/362/31033604472221",
			"DC_OLD": "546/140033/371/67/31033604465511",
			"GT": "620/113215/220/43/31033604507506"
		},
		"freeze": {
			"default": "575/153310/123/250/31167700273561",
			"XT": "545/126533/221/204/31033604562720",
			"XT_HD": "607/133452/43/130/31033604565055",
			"LC": "605/14613/143/127/31033604552551",
			"IC": "605/135171/211/104/31033604546324",
			"GT": "613/146472/243/156/31033604531607",
			"SE": "575/141301/263/323/31033604560325"
		},
		"isida": {
			"default": "605/12650/334/263/31167700276234",
			"XT": "547/121262/134/345/31033604677132",
			"LC": "606/155040/263/253/31033604672363",
			"GT": "605/12655/270/246/31033604660301"
		},
		"tesla": {
			"default": "567/20040/100/57/31167700274267",
			"XT_HD": "567/20040/100/30/31033605140327",
			"LC": "604/60235/244/25/31033605125726",
			"RF": "616/167677/151/223/31033605130425"
		},
		"hammer": {
			"default": "611/147301/37/333/31167700274311",
			"XT": "550/160307/363/221/31033604643362",
			"LC": "601/166273/204/221/31033604634650",
			"DC": "604/4215/36/135/31033605266363",
			"IC": "623/41371/53/15/31150312633557",
			"GT": "623/151743/74/104/31173555130540"
		},
		"twins": {
			"default": "575/4122/336/247/31167700272424",
			"XT": "547/35525/56/66/31033605232035",
			"LC": "577/157371/340/255/31033605210405",
			"SP": "573/113554/112/100/31033605224225",
			"RF": "607/24114/77/214/31033605215045",
			"GT": "617/163502/325/41/31033605175257"
		},
		"ricochet": {
			"default": "603/121326/210/264/31167700267554",
			"XT": "546/5477/152/352/31033605004772",
			"LC": "556/131232/204/234/31033604772501",
			"RF": "577/176465/41/10/31033605000151"
		},
		"vulcan": {
			"default": "622/107753/242/303/31167700276134",
			"XT": "0/16722/260/334/31033604733427",
			"PR": "556/15741/256/125/31033605241104",
			"UT": "560/31363/210/347/31033604717360",
			"DC": "613/2044/314/224/31033604703141"
		},
		"smoky": {
			"default": "566/114246/64/4/31167700272332",
			"XT": "0/114/153/53/31033605053755",
			"LC": "577/171773/42/54/31033605047550",
			"GT": "607/133661/133/27/31033605036471"
		},
		"striker": {
			"default": "0/16723/37/11/31167700275767",
			"XT": "551/70756/233/273/31033605117137",
			"UT": "570/164502/316/245/31033605234224"
		},
		"thunder": {
			"default": "601/105644/16/124/31167700273301",
			"XT": "0/16722/167/101/31033605170145",
			"PR": "557/14251/175/251/31033605155427",
			"UT": "551/122165/142/136/31033605157155",
			"LC": "545/14356/174/306/31033605151121",
			"GT": "603/104171/41/115/31033605030161",
			"XT_HD": "617/134472/113/60/31033605164111"
		},
		"scorpion": {
			"default": "600/40107/4/364/31172771520222",
			"XT_HD": "602/132677/206/41/31033605253521"
		},
		"magnum": {
			"default": "0/16723/57/323/31167700274631",
			"XT": "550/75104/53/350/31033604732253",
			"SP": "612/42416/374/133/31033604725533",
			"雪人": "575/77444/65/233/31167700273100"
		},
		"railgun": {
			"default": "567/105205/202/122/31167700270037",
			"XT": "0/16722/6/301/31033604764033",
			"LC": "550/121443/145/146/31033604745456",
			"PR": "553/116715/27/132/31033604752652",
			"UT": "556/177362/212/346/31033604754562",
			"GT": "606/155010/245/142/31033604735353"
		},
		"gauss": {
			"default": "611/61722/256/76/31167700275006",
			"XT": "560/124462/246/14/31033604617041",
			"PR": "554/41313/45/141/31033604572567",
			"UT": "563/51105/72/133/31033605272237",
			"GT": "613/146442/233/316/31033604574743",
			"IC": "614/75662/326/41/31033604602505"
		},
		"shaft": {
			"default": "622/21305/321/374/31167700272525",
			"XT": "546/73531/62/216/31033605014624",
			"LC": "600/170471/174/26/31033605260624",
			"DC": "622/107573/220/101/31123207764670",
			"GT": "623/152225/145/72/31172445577356"
		}
	};

	const hullsRedirectMap = {
		"wasp": {
			"default": "574/111243/33/322/31167700276263",
			"XT": "0/16722/167/77/31033610130736",
			"DC": "574/113351/211/154/31033610052500",
			"LC": "577/171773/42/62/31033610115062",
			"GT": "620/112773/325/5/31033610100325"
		},
		"hopper": {
			"default": "564/5207/367/304/31167700276066",
			"XT_HD": "564/41402/173/47/31033610315703",
			"RF": "616/167677/151/211/31033607331063"
		},
		"hornet": {
			"default": "566/70102/323/346/31167700274103",
			"XT": "0/16722/6/305/31033607424605",
			"LC": "551/32007/310/225/31033607400400",
			"PR": "553/1466/317/276/31033607413764",
			"UT": "562/165115/303/236/31033610210055",
			"GT": "605/27506/77/216/31033607347661",
			"XT_HD": "623/127512/235/65/31166467457145"
		},
		"viking": {
			"default": "571/121215/5/23/31167700276142",
			"XT": "0/16722/167/76/31033610034165",
			"LC": "545/14403/373/22/31033607776373",
			"PR": "557/14273/215/344/31033610007323",
			"UT": "552/54655/57/366/31033610356100",
			"GT": "603/64520/263/244/31033607745375",
			"XT_HD": "606/155145/337/205/31033610020277",
			"DC": "604/7224/253/317/31033610256112"
		},
		"crusader": {
			"default": "566/4547/232/306/31167700273327",
			"XT_HD": "566/40410/335/237/31033610341433",
			"RF": "607/24114/77/31/31033607224317"
		},
		"hunter": {
			"default": "567/166366/55/140/31167700272025",
			"XT": "547/121236/44/244/31033607523721",
			"LC": "577/157453/256/241/31033607506717",
			"PR": "554/155720/136/73/31033607521775",
			"UT": "561/113562/137/140/31033610302174",
			"GT": "607/133630/253/171/31033607471473",
			"DC": "613/14407/324/50/31033607446007"
		},
		"paladin": {
			"default": "573/47363/125/65/31167700273617",
			"XT_HD": "573/47363/125/60/31033610367705",
			"RF": "577/176465/41/12/31033607640405"
		},
		"dictator": {
			"default": "602/61700/245/106/31167700275611",
			"XT": "546/125503/267/14/31033607303502",
			"LC": "600/170471/174/17/31033610146055",
			"GT": "606/154745/265/375/31033607235725",
			"SP": "621/133615/104/57/31066757323353"
		},
		"titan": {
			"default": "606/22645/10/357/31167700270522",
			"XT": "545/41207/304/132/31033607734572",
			"LC": "601/166273/204/222/31033607677022",
			"PR": "555/103037/265/247/31033607711541",
			"SP": "612/40333/350/361/31033607720032"
		},
		"ares": {
			"default": "560/117661/334/334/31167700276015",
			"XT_HD": "562/161162/24/375/31033610137021"
		},
		"mammoth": {
			"default": "600/67314/131/54/31167700271637",
			"XT": "0/16722/260/335/31033607615546",
			"LC": "557/31354/323/254/31033607553520",
			"UT": "571/76747/372/131/31033610235472",
			"SP": "573/113554/112/106/31033607575155",
			"GT": "617/163502/325/33/31033607536216"
		}
	};

	const dronesRedirectMap = {
		"hyperion": {
			"default": "556/107004/326/35/31167700276045",
			"XT": "603/140170/104/322/30545000710642"
		},
		"crisis": {
			"default": "562/45273/110/127/31167700270140",
			"XT": "602/142250/300/167/30545000710756"
		}
	};
	const festivalsRedirectMap = {
		"garage": {
			"default": "601/166176/165/206/31167700267244",
			"万圣节": "613/2501/252/46/30545000710615",
			"新年_2025": "623/152656/155/20/31173045365546"
		},
		"sandbox_summer": {
			"default": "570/174542/371/60/30544532052123",
			"教程": "0/1/304/263/30741245714771"
		},
		"sandbox_winter": {
			"default": "570/174542/371/61/30544540056777",
			"节日季节 主题": "570/174542/371/62/30544541264567"
		},
		"forest_winter": {
			"default": "0/16723/204/143/30545207067664",
			"节日季节 主题": "0/16723/204/144/30545210267003"
		},
		"new_years_library": {
			"default": "553/105167/27/302/30546776460526",
			"新年 重制": "570/174542/371/71/31167243462337"
		},
		"new_years_map": {
			"default": "544/77313/263/311/30545211407625",
			"新年 重制": "570/174542/371/72/31167257256577"
		},
		"new_years_music": {
			"default": "602/103320/104/163/30654312275414",
			"节日季节 主题": "575/163160/137/356/30653770533354",
			"新年 重制": "575/163160/137/356/30653770533354"
		}
	};
	const shotEffectsRedirectMap = {
		"firebird_1": {
			"default": "546/145213/173/213/30545000703101",
			"幻影黑": "546/145213/172/34/30545000702774",
			"岩浆": "546/145213/173/346/30545000702745",
			"粉红色": "546/145213/173/61/30545000702662",
			"深红色": "546/145213/174/101/30545000703037"
		},
		"firebird_2": {
			"default": "546/145213/174/235/30545000702754",
			"幻影黑": "546/145213/172/326/30545000703020",
			"岩浆": "546/145213/172/171/30545000703031",
			"粉红色": "546/145213/171/277/30545000703113",
			"深红色": "546/145213/171/142/30545000702773"
		},
		"freeze_1": {
			"default": "546/145213/144/251/30545000702776",
			"寒冷": "546/145213/143/357/30545000703103",
			"毒": "546/145213/142/53/30545000702770",
			"暗月": "546/145213/143/223/30545000703120",
			"雪": "546/145213/142/340/30545000703124"
		},
		"freeze_2": {
			"default": "546/145213/142/206/30545000703057",
			"寒冷": "546/145213/144/114/30545000703120",
			"毒": "546/145213/141/312/30545000702717",
			"暗月": "546/145213/143/72/30545000703045",
			"雪": "546/145213/141/157/30545000702630"
		},
		"isida_1": {
			"default": "546/147613/376/315/30545000606067",
			"火": "546/147614/265/140/30545000606433",
			"太阳": "546/147614/315/217/30545000607355",

		},
		"isida_2": {
			"default": "546/145213/157/16/30545000703112",
			"火": "546/145213/160/314/30545000702744",
			"太阳": "546/145213/157/147/30545000703060"
		},
		"tesla_1": {
			"default": "562/24337/265/306/30545000607156"
		},
		"tesla_2": {
			"default": "562/24337/265/320/30545000606123"
		},
		"tesla_3": {
			"default": "545/117451/153/325/30545000607527"
		},
		"hammer_1": {
			"default": "0/16721/360/363/30545000605632",
			"水": "552/51671/2/323/30545000605746",
			"岩浆": "552/53566/151/315/30545000606146",
			"虚空": "552/53601/214/6/30545000607100",
			"毒": "552/53572/352/35/30545000606234",
			"日食": "552/52027/331/152/30545000606672",
			"天空蓝": "552/52016/127/345/30545000607136",
			"血液": "552/52003/10/225/30545000606004"
		},
		"hammer_2": {
			"default": "0/16721/360/354/30545000702655",
			"水": "552/51665/316/67/30545000703052",
			"岩浆": "552/52036/52/14/30545000703064",
			"虚空": "552/53576/213/137/30545000703100",
			"毒": "552/53567/222/305/30545000702727",
			"日食": "552/52025/323/24/30545000702651",
			"天空蓝": "552/52013/202/106/30545000703040",
			"血液": "552/52001/105/321/30545000703016"
		},
		"hammer_3": {
			"default": "0/16721/360/353/30545000702716",
			"水": "552/51633/372/42/30545000703044",
			"岩浆": "552/51660/351/135/30545000702664",
			"虚空": "552/51663/251/302/30545000703110",
			"毒": "552/51662/112/72/30545000702771",
			"日食": "552/51651/115/372/30545000702724",
			"天空蓝": "552/51641/324/356/30545000702734",
			"血液": "552/51636/14/205/30545000702615"
		},
		"hammer_4": {
			"default": "0/16721/360/362/30545000607320",
			"水": "552/51670/1/143/30545000606152",
			"岩浆": "552/53565/327/202/30545000605737",
			"虚空": "552/53600/174/213/30545000606610",
			"毒": "552/53572/120/76/30545000607202",
			"日食": "552/52027/112/70/30545000605577",
			"天空蓝": "552/52015/322/160/30545000606065",
			"血液": "552/52002/222/200/30545000605627"
		},
		"twins_1": {
			"default": "546/145213/165/145/30545000702663",
			"珊瑚礁": "546/145213/165/10/30545000702632",
			"暗月": "546/145213/164/122/30545000703054",
			"天空": "546/145213/167/352/30545000703121",
			"金": "546/145213/163/371/30545000703070",
			"紫罗兰色": "546/145213/170/106/30545000702645",
			"电": "546/145213/161/336/30545000703015"
		},
		"twins_2": {
			"default": "546/147411/176/204/30545000607302",
			"珊瑚礁": "546/147443/56/222/30545000607142",
			"暗月": "546/147443/205/75/30545000606311",
			"天空": "546/147444/204/315/30545000607034",
			"金": "546/147444/25/271/30545000606000",
			"紫罗兰色": "546/147444/336/41/30545000606005",
			"电": "546/147443/331/145/30545000606131"
		},
		"twins_3": {
			"default": "546/145213/166/330/30545000702745",
			"珊瑚礁": "546/145213/166/37/30545000703044",
			"暗月": "546/145213/165/302/30545000703114",
			"天空": "546/145213/163/240/30545000702777",
			"金": "546/145213/167/215/30545000702475",
			"紫罗兰色": "546/145213/162/355/30545000703011",
			"电": "546/145213/171/0/30545000702716"
		},
        "twins_sound_1": {
            "default": "0/114/113/232/30654312334330",
            "爆破手": "600/155645/173/315/30653771331454"
        },
        "twins_sound_2": {
            "爆破手": "600/155645/173/305/30653771331271"
        },
		"ricochet_1": {
			"default": "546/147741/131/160/30545000606467",
			"电": "546/147741/302/146/30545000607410",
			"金": "546/147743/0/265/30545000607037",
			"深红色": "546/147741/236/332/30545000607462",
			"烟雾": "546/147743/74/211/30545000606654",
			"岩浆": "546/147743/37/47/30545000605725",
			"紫罗兰色": "546/147744/61/264/30545000607335",
			"毒": "546/147743/143/272/30545000607221",
			"水": "546/147741/204/277/30545000605736",
			"爆破手": null
		},
		"ricochet_2": {
			"default": "546/145213/211/227/30545000703056",
			"电": "546/145213/210/204/30545000702650",
			"金": "546/145213/201/277/30545000703045",
			"深红色": "546/145213/203/206/30545000702623",
			"烟雾": "546/145213/211/362/30545000702723",
			"岩浆": "546/145213/212/250/30545000702757",
			"紫罗兰色": "546/145213/203/340/30545000702614",
			"毒": "546/145213/210/50/30545000702604",
			"水": "546/145213/206/271/30545000702771",
			"爆破手": null
		},
		"ricochet_3": {
			"default": "546/145213/207/24/30545000703106",
			"电": "546/145213/206/136/30545000703055",
			"金": "546/145213/214/32/30545000703012",
			"深红色": "546/145213/205/250/30545000703067",
			"烟雾": "546/145213/213/275/30545000703105",
			"岩浆": "546/145213/205/115/30545000703036",
			"紫罗兰色": "546/145213/202/165/30545000702775",
			"毒": "546/145213/207/160/30545000702565",
			"水": "546/145213/211/73/30545000703041",
			"爆破手": null
		},
		"ricochet_4": {
			"default": "546/147746/300/166/30545000605533",
			"电": "546/147747/362/5/30545000607041",
			"金": "546/147750/20/205/30545000605607",
			"深红色": "546/147746/376/1/30545000606504",
			"烟雾": "546/147760/47/244/30545000605531",
			"岩浆": "546/147750/54/23/30545000606260",
			"紫罗兰色": "546/147760/144/56/30545000606624",
			"毒": "546/147760/77/170/30545000605361",
			"水": "546/147746/341/23/30545000607474",
			"爆破手": null
		},
        "richchet_sound_1": {
            "default": "0/114/141/75/30653771331544",
            "爆破手": null
        },
        "richchet_sound_2": {
            "default": "0/114/141/74/30653771331450",
            "爆破手": null
        },
        "richchet_sound_3": {
            "default": "0/114/141/110/30653771331253",
            "爆破手": null
        },
		"vulcan_1": {
			"default": "546/145213/124/120/30545000703060",
			"神秘的红色": "560/33733/324/111/30545000702647"
		},
		"vulcan_2": {
			"default": "546/145213/117/343/30545000702623",
			"神秘的红色": "560/33733/324/104/30545000702743"
		},
		"smoky_1": {
			"default": "546/145213/140/271/30545000702755"
		},
		"smoky_2": {
			"default": "0/1374/264/44/30545000607440"
		},
		"smoky_3": {
			"default": "566/124613/346/51/30545000606147"
		},
		"smoky_4": {
			"default": "566/124613/346/64/30545000607002"
		},
		"smoky_5": {
			"default": "566/124613/346/70/30545000606325"
		},
		"smoky_6": {
			"default": "566/124613/346/65/30545000702606"
		},
		"smoky_7": {
			"default": "566/124716/12/375/30545000607150"
		},
		"smoky_8": {
			"default": "555/127561/370/247/30545000605433"
		},
		"striker_1": {
			"default": "546/145213/114/104/30545000703026",
			"紫罗兰色": "546/145213/115/262/30545000702665",
			"毒": "546/145213/116/316/30545000702574",
			"深红色": "546/145213/116/23/30545000702746",
			"天空蓝": "546/145213/113/212/30545000702642"
		},
		"striker_2": {
			"default": "546/150052/46/102/30545000605332",
			"紫罗兰色": "546/150053/175/72/30545000607442",
			"毒": "546/150053/43/77/30545000607372",
			"深红色": "546/150052/352/51/30545000606042",
			"天空蓝": "546/150052/222/172/30545000607270"
		},
		"thunder_1": {
			"default": "546/145213/174/374/30545000703122"
		},
		"thunder_2": {
			"default": "555/127645/160/2/30545000605641"
		},
		"thunder_3": {
			"default": "555/127647/64/315/30545000607202"
		},
		"thunder_4": {
			"default": "555/127647/233/165/30545000606002"
		},
		"thunder_5": {
			"default": "555/127650/133/357/30545000605351"
		},
		"scorpion_1": {
			"default": "546/145213/177/370/30545000702654"
		},
		"scorpion_2": {
			"default": "0/16723/73/211/30545000606641"
		},
		"scorpion_3": {
			"default": "0/16723/73/210/30545000607024"
		},
		"magnum_1": {
			"default": "546/145213/177/44/30545000702741",
			"天空蓝": "554/153573/307/234/30545000703017",
			"深红色": "554/153573/310/141/30545000702743",
			"毒": "554/153573/311/60/30545000702612",
			"紫罗兰色": "554/153573/311/171/30545000703070",
			"日食": "554/153573/310/340/30545000702671"
		},
		"magnum_2": {
			"default": "546/145213/177/370/30545000702654",
			"天空蓝": "554/153573/311/277/30545000702760",
			"深红色": "554/153573/312/2/30545000702566",
			"毒": "554/153573/312/212/30545000702764",
			"紫罗兰色": "554/153573/312/317/30545000703014",
			"日食": "554/153573/312/106/30545000702730"
		},

		"railgun_1": {
			"default": "546/150126/51/246/30545000607361",
			"血液": "546/150135/217/70/30545000607516",
			"橄榄绿": "546/150137/76/311/30545000607006",
			"雪": "546/150137/212/373/30545000607076",
			"天空蓝": "546/150136/157/164/30545000605652",
			"金": "546/150136/371/37/30545000605757",
			"紫罗兰色": "546/150137/313/47/30545000607434",
			"黑暗": "546/150136/262/137/30545000607033"
		},
		"railgun_2": {
			"default": "546/150126/253/153/30545000607325",
			"血液": "546/150140/120/227/30545000605435",
			"橄榄绿": "546/150141/317/134/30545000607352",
			"雪": "546/150142/34/243/30545000606654",
			"天空蓝": "546/150140/221/33/30545000607077",
			"金": "546/150141/177/276/30545000606471",
			"紫罗兰色": "546/150142/141/114/30545000605736",
			"黑暗": "546/150140/335/362/30545000605561"
		},
		"railgun_3": {
			"default": "546/150125/227/36/30545000606325",
			"血液": "546/150132/137/312/30545000606477",
			"橄榄绿": "546/150133/361/63/30545000607371",
			"雪": "546/150134/61/330/30545000607361",
			"天空蓝": "546/150132/273/312/30545000607533",
			"金": "546/150133/175/343/30545000607547",
			"紫罗兰色": "546/150134/177/241/30545000605424",
			"黑暗": "546/150133/65/175/30545000607422"
		},
        "railgun_4": {
            "default": "614/167157/112/162/30635634260772",
            "魔法": "615/171467/335/170/30706105525223"
        },
        "railgun_sound": {
            "default": "0/114/113/314/30654312335235",
            "魔法": "617/51351/145/71/30752715761312"
        },
		"gauss_1": {
			"default": "552/132670/36/315/30545000606571",
			"暴力": "560/161445/44/340/30545000607420"
		},
		"gauss_2": {
			"default": "552/132670/163/5/30545000607131",
			"暴力": "560/161445/44/342/30545000607416"
		},
		"gauss_3": {
			"default": "552/132672/57/244/30545000606601",
			"暴力": "560/161445/44/341/30545000606255"
		},
		"gauss_4": {
			"default": "552/132667/104/225/30545000702742",
			"暴力": "560/161445/44/337/30545000702761"
		},
		"gauss_5": {
			"default": "552/132667/257/15/30545000703127",
			"暴力": "560/161445/44/324/30545000703027"
		},
		"gauss_6": {
			"default": "552/132672/221/154/30545000607025",
			"暴力": "560/161445/44/336/30545000606725"
		},
		"gauss_7": {
			"default": "552/132666/160/177/30545000606500",
			"暴力": "560/161445/44/343/30545000606270"
		},
		"gauss_8": {
			"default": "552/132671/132/330/30545000607211",
			"暴力": "560/161445/44/334/30545000606221"
		},
		"shaft_1": {
			"default": "546/145213/127/45/30545000703054",
			"天空蓝": "546/145213/135/15/30545000703075",
			"日食": "546/145213/130/216/30545000703046",
			"正午": "546/145213/134/5/30545000703107",
			"橄榄绿": "546/145213/127/333/30545000703031",
			"水": "546/145213/130/346/30545000702761",
			"虚空": "546/145213/131/77/30545000703035",
			"血液": "546/145213/133/124/30545000703047",
			"紫罗兰色": "546/145213/126/45/30545000703100",
			"岩浆": "546/145213/134/135/30545000703123"
		},
		"shaft_2": {
			"default": "546/145213/132/373/30545000703117",
			"天空蓝": "546/145213/130/65/30545000703014",
			"日食": "546/145213/127/200/30545000702732",
			"正午": "546/145213/137/251/30545000702663",
			"橄榄绿": "546/145213/133/254/30545000702624",
			"水": "546/145213/136/101/30545000703113",
			"虚空": "546/145213/131/230/30545000703066",
			"血液": "546/145213/135/147/30545000702626",
			"紫罗兰色": "546/145213/126/314/30545000703004",
			"岩浆": "546/145213/136/364/30545000703060"
		},
		"shaft_3": {
			"default": "546/150162/53/137/30545000605710",
			"天空蓝": "546/150162/346/234/30545000607140",
			"日食": "546/150163/364/61/30545000606306",
			"正午": "546/150165/141/234/30545000606565",
			"橄榄绿": "546/150164/102/322/30545000607471",
			"水": "546/150162/233/365/30545000606632",
			"虚空": "546/150165/346/273/30545000606650",
			"血液": "546/150163/72/47/30545000606655",
			"紫罗兰色": "546/150165/250/233/30545000605723",
			"岩浆": "546/150164/204/117/30545000607517"
		},
        "boost_armor_sound": {
            "default": "0/16723/157/341/30654312276460",
            "危机": "562/50436/64/45/30654312310442"
        },
        "boost_damage_sound": {
            "default": "0/16723/157/343/30654312276671",
            "危机": "562/50436/64/57/30654312276474"
        },
        "boost_speed_sound": {
            "default": "0/16723/157/346/30654312306133",
            "危机": "562/50436/64/61/30654312314022"
        }
	};
	const paintsRedirectMap = {
		"paints": {
			"橄榄绿": "0/0/332/376/30545000607534",
			"中国红": "0/0/345/314/30545000606635",
			"光谱": "537/157270/46/364/30545000703055",
			"坦克币坦克": "556/15724/147/2/30545000702723",
            "天空蓝": "610/51505/40/77/30545000606404",
            "幻影黑": "0/0/332/373/30545000606672",
            "海蓝色": "610/51503/310/365/30545000606240",
            "芥末": "615/77267/341/375/30660323773566",
            "雪山飞狐": "0/0/345/317/30545000607502",
            "黄马甲": "610/51507/145/136/30545000607100",
            "珊瑚色": "610/51505/270/232/30545000607452",
            "苹果色": "610/51502/260/102/30545000607557",
            "合金装备": "0/0/345/311/30545000605127",
            "平静": "615/77267/166/44/30660323745713",
            "紫红色": "610/51506/123/64/30545000607075",
            "褐红色": "0/0/345/314/30545000606635",
            "黄色": "610/51510/310/171/30545000607204",
            "偏蓝色": "610/51504/137/145/30545000606503",
            "紫罗兰色": "610/51510/145/53/30545000607357",
            "金色": "610/51507/23/220/30545000606776",
            "乌拉圭": "0/16721/126/71/30545000606647",
            "喀麦隆": "0/16721/125/215/30545000607105",
            "巴拿马": "544/1033/64/360/30545000606721",
            "希腊": "0/16721/125/201/30545000606136",
            "废墟": "0/114/122/55/30545000606036",
            "森林": "0/0/333/1/30545000605414",
            "法国": "0/16721/125/171/30545000606654",
            "流沙": "0/114/144/26/30545000607301",
            "游击队": "0/16722/56/166/30545000607467",
            "热带": "0/114/114/101/30545000605636",
            "磐石": "0/114/144/27/30545000606312",
            "红色城市": "0/16723/6/14/30545000606071",
            "翡翠": "0/114/164/111/30545000606253",
            "锈斑": "0/114/143/110/30545000606651",
            "阿根廷": "0/16721/125/153/30545000606432",
            "丛林杀手": "0/114/144/24/30545000606313",
            "五彩纸屑": "0/16722/363/252/30545000606637",
            "俄罗斯": "0/16721/126/65/30545000607105",
            "克罗地亚": "0/16721/125/203/30545000607535",
            "冰岛": "0/16722/350/355/30545000606721",
            "哥伦比亚": "0/16721/125/217/30545000607417",
            "埃及": "544/1033/63/340/30545000606027",
            "塞内加尔": "544/1033/65/311/30545000607171",
            "威尔士": "0/16722/350/357/30545000607000",
            "岩浆": "0/16722/35/4/30545000607012",
            "意大利": "0/16721/125/211/30545000607513",
            "摩洛哥": "544/1033/64/160/30545000606441",
            "漩涡": "0/16722/56/175/30545000606567",
            "智利": "0/16721/125/166/30545000607360",
            "松针": "0/114/164/76/30545000605431",
            "比利时": "0/16721/125/157/30545000607333",
            "沙漠": "0/114/114/77/30545000607076",
            "沼泽": "0/114/122/52/30545000606151",
            "波斯尼亚和黑塞哥维那": "0/16721/125/161/30545000606335",
            "澳大利亚": "0/16721/125/155/30545000605701",
            "瑞典": "544/1033/66/241/30545000607345",
            "突尼斯": "544/1033/75/236/30545000607202",
            "草原": "0/16723/6/15/30545000606777",
            "葡萄牙": "0/16721/126/63/30545000606254",
            "象牙海岸": "0/16721/125/225/30545000606564",
            "雪松": "0/114/144/25/30545000607412",
            "风语者": "0/114/143/106/30545000606431",
            "加纳": "0/16721/125/173/30545000605713",
            "墨西哥": "0/16721/125/227/30545000607442",
            "巴西": "0/16721/125/163/30545000606642",
            "幻影骑士": "0/114/122/101/30545000606211",
            "极地隐身": "0/114/144/43/30545000606434",
            "樱桃": "0/16722/56/163/30545000607321",
            "洪都拉斯": "0/16721/125/177/30545000607207",
            "海军": "0/114/114/100/30545000606524",
            "激浪": "0/114/143/51/30545000607211",
            "瑞士": "0/16721/126/67/30545000606313",
            "秘鲁": "544/1050/246/162/30545000605552",
            "美国": "0/16721/126/73/30545000606511",
            "苔藓": "0/16722/363/257/30545000606463",
            "阿尔及利亚": "0/16721/125/147/30545000606774",
            "丛林": "0/0/332/370/30545000607415",
            "丹麦": "544/1032/215/315/30545000606131",
            "伊朗伊斯兰共和国": "0/16721/125/205/30545000607132",
            "像素": "0/16722/35/7/30545000607016",
            "冬天": "0/114/122/102/30545000607276",
            "厄瓜多尔": "0/16721/125/167/30545000606656",
            "哥斯达黎加": "0/16721/125/223/30545000607440",
            "城市": "0/114/114/102/30545000606613",
            "塞尔维亚": "544/1033/66/66/30545000605756",
            "尼日利亚": "0/16721/126/61/30545000606503",
            "德国": "0/16721/125/175/30545000606327",
            "日本": "0/16721/125/213/30545000606641",
            "暴风雪": "0/114/143/112/30545000606104",
            "极地沼泽": "0/114/144/42/30545000607532",
            "毕加索": "0/114/164/75/30545000606717",
            "沙特阿拉伯": "544/1033/65/137/30545000607222",
            "波兰": "0/16722/350/356/30545000605703",
            "泥浆": "0/114/143/107/30545000607441",
            "火星": "0/16722/35/5/30545000607042",
            "破绽": "0/16722/56/164/30545000607017",
            "英格兰": "0/16721/125/151/30545000607121",
            "荷兰": "0/16721/126/57/30545000607311",
            "西班牙": "0/16721/125/207/30545000605530",
            "隐身衣": "0/114/122/36/30545000607206",
            "韩国": "0/16721/125/221/30545000607375",
            "万花筒": "0/16722/363/255/30545000606454",
            "古典": "0/114/143/111/30545000605745",
            "斑纹": "0/114/121/372/30545000607316",
            "原子": "0/16722/35/2/30545000606151",
            "外星伪装": "0/114/122/56/30545000607130",
            "宙斯": "0/114/156/134/30545000606631",
            "樱花": "0/16722/56/174/30545000607447",
            "死亡骑士": "0/114/122/11/30545000605726",
            "涂鸦": "0/16722/56/165/30545000606005",
            "火山": "0/0/345/303/30545000607074",
            "爱你一万年": "0/16722/62/45/30545000606502",
            "牛仔裤": "0/16722/363/254/30545000607354",
            "番茄玛丽": "0/114/143/152/30545000607222",
            "绿宝石": "0/114/156/135/30545000607452",
            "蜂巢": "0/16722/56/167/30545000606230",
            "迪斯科": "0/16722/363/253/30545000605530",
            "铁匠": "0/16722/56/162/30545000607212",
            "龙鳞骑士": "0/114/121/371/30545000607115",
            "上帝之眼": "0/114/122/7/30545000607561",
            "伐木工": "0/16722/56/171/30545000605744",
            "侵略者": "0/16722/56/170/30545000607075",
            "像素心": "0/16722/356/153/30545000606732",
            "初恋": "0/16722/356/155/30545000606424",
            "地狱火": "0/114/156/150/30545000606262",
            "夜晚": "0/16722/356/152/30545000605511",
            "宇宙空间": "0/16722/356/157/30545000607135",
            "撒哈拉沙漠": "0/16722/363/260/30545000607351",
            "毛线衣": "0/16722/356/156/30545000605507",
            "浣熊": "0/16722/56/172/30545000607117",
            "滑稽演员": "0/16722/363/251/30545000607373",
            "犀牛": "0/16722/56/173/30545000606546",
            "猛虎": "0/16722/35/10/30545000606657",
            "碳纤": "0/114/122/34/30545000606660",
            "纳米": "0/16722/35/6/30545000605574",
            "花火": "0/114/143/50/30545000607560",
            "蟒蛇": "0/114/143/153/30545000605516",
            "软花": "0/16722/356/154/30545000607034",
            "金钱豹": "0/114/121/370/30545000605222",
            "链甲": "0/16722/35/3/30545000607471",
            "镀铅": "0/114/164/365/30545000607406",
            "雪豹": "0/114/165/3/30545000606043",
            "非洲": "0/16722/56/161/30545000606024"
		}
	};

	const hullsPattern = /^(|XT|XT_HD|LC|PR|UT|DC|GT|RF|SP)$/i;
	const turretsPattern = /^(|XT|XT_HD|LC|PR|UT|DC|DC_OLD|IC|GT|RF|SE|SP|雪人)$/i;
	const dronesPattern = /^(|XT)$/i;
	const festivalsPattern = /^(|万圣节|新年_2025|节日季节 主题|新年 重制|教程)$/i;
	const shotEffectsPattern = /^(|幻影黑|岩浆|粉红色|寒冷|毒|火|太阳|水|珊瑚礁|暗月|电|金|深红色|紫罗兰色|天空蓝|暴力|爆破手|黑暗|魔法|日食|神秘的红色|天空|虚空|血液|雪|正午|烟雾|危机)$/i;
	const paintsPattern = /^(|橄榄绿|中国红|光谱|坦克币坦克|天空蓝|幻影黑|海蓝色|芥末|雪山飞狐|黄马甲|珊瑚色|苹果色|合金装备|平静|紫红色|褐红色|黄色|偏蓝色|紫罗兰色|金色|乌拉圭|喀麦隆|巴拿马|希腊|废墟|森林|法国|流沙|游击队|热带|磐石|红色城市|翡翠|锈斑|阿根廷|丛林杀手|五彩纸屑|俄罗斯|克罗地亚|冰岛|哥伦比亚|埃及|塞内加尔|威尔士|岩浆|意大利|摩洛哥|漩涡|智利|松针|比利时|沙漠|沼泽|波斯尼亚和黑塞哥维那|澳大利亚|瑞典|突尼斯|草原|葡萄牙|象牙海岸|雪松|风语者|加纳|墨西哥|巴西|幻影骑士|极地隐身|樱桃|洪都拉斯|海军|激浪|瑞士|秘鲁|美国|苔藓|阿尔及利亚|丛林|丹麦|伊朗伊斯兰共和国|像素|冬天|厄瓜多尔|哥斯达黎加|城市|塞尔维亚|尼日利亚|德国|日本|暴风雪|极地沼泽|毕加索|沙特阿拉伯|波兰|泥浆|火星|破绽|英格兰|荷兰|西班牙|隐身衣|韩国|万花筒|古典|斑纹|原子|外星伪装|宙斯|樱花|死亡骑士|涂鸦|火山|爱你一万年|牛仔裤|番茄玛丽|绿宝石|蜂巢|迪斯科|铁匠|龙鳞骑士|上帝之眼|伐木工|侵略者|像素心|初恋|地狱火|夜晚|宇宙空间|撒哈拉沙漠|毛线衣|浣熊|滑稽演员|犀牛|猛虎|碳纤|纳米|花火|蟒蛇|软花|金钱豹|链甲|镀铅|雪豹|非洲)$/i;

	let lastHullChoice = localStorage.getItem('userChoiceHull') || '';
	let lastTurretChoice = localStorage.getItem('userChoiceTurret') || '';
	let lastDroneChoice = localStorage.getItem('userChoiceDrone') || '';
	let lastFestivalChoice = localStorage.getItem('userChoiceFestival') || '';
	let lastShotEffectChoice = localStorage.getItem('userChoiceShotEffect') || '';
	let lastOriginalPaintChoice = localStorage.getItem('originalChoicePaint') || '';
	let lastNewPaintChoice = localStorage.getItem('newChoicePaint') || '';

	function getUserChoice(promptMessage, lastChoice, pattern, invalidMessage) {
		let userChoice = prompt(promptMessage, lastChoice);
		if (userChoice === null) {
			return '';
		} else {
			while (!pattern.test(userChoice)) {
				alert(invalidMessage);
				userChoice = prompt(promptMessage, lastChoice);
				if (userChoice === null) {
					return '';
				}
			}
		}
		return userChoice;
	}

	let userChoiceHull = getUserChoice(
		"请选择要使用的底盘模型替换 (XT/XT_HD(XT 高清)/LC（遗产）/PR（青春）/UT（超高）/DC（恶魔）/GT（跑车）/RF（复古未来）/SP（蒸汽朋克）)（点击取消可不进行替换）:",
		lastHullChoice,
		hullsPattern,
		"输入无效，请输入有效的底盘皮肤系列：XT, XT_HD, LC, PR, UT, DC, GT, RF, SP"
	);

	let userChoiceTurret = getUserChoice(
		"请选择要使用的炮塔模型替换 (XT/XT_HD（XT 高清）/LC（遗产）/PR（青春）/UT（超高）/DC（恶魔）/DC_OLD（恶魔旧）/IC（冰）/GT（跑车）/RF（复古未来）/SE（秘密）/SP（蒸汽朋克）)（点击取消可不进行替换）:",
		lastTurretChoice,
		turretsPattern,
		"输入无效，请输入有效的炮塔皮肤系列：XT, XT_HD, LC, PR, UT, DC, DC_OLD, IC, GT, RF, SE, SP"
	);

	let userChoiceDrone = getUserChoice(
		"请选择要使用的无人机模型替换 (XT)（点击取消可不进行替换）:",
		lastDroneChoice,
		dronesPattern,
		"输入无效，请输入有效的无人机皮肤系列：XT"
	);

	let userChoiceFestival = getUserChoice(
		"请选择要使用的节日替换 (万圣节/新年_2025)（点击取消可不进行替换）:",
		lastFestivalChoice,
		festivalsPattern,
		"输入无效，请输入有效的节日：万圣节, 新年_2025"
	);

	let userChoiceShotEffect = getUserChoice(
		"请选择要使用的射击效果替换 (幻影黑/岩浆/粉红色/寒冷/毒/火/太阳/水/珊瑚礁/暗月/电/金/深红色/紫罗兰色/天空蓝/暴力/黑暗/日食/神秘的红色/天空/虚空/血液/雪/正午/烟雾)（点击取消可不进行替换，不支持爆破手和魔法）:",
		lastShotEffectChoice,
		shotEffectsPattern,
		"输入无效，请输入有效的射击效果：幻影黑, 岩浆, 粉红色, 寒冷, 毒, 火, 太阳, 水, 珊瑚礁, 暗月, 电, 金, 深红色, 紫罗兰色, 天空蓝, 暴力, 黑暗, 日食, 神秘的红色, 天空, 虚空, 血液, 雪, 正午, 烟雾"
	);

	let originalChoicePaint = getUserChoice(
		"请选择待替换迷彩（点击取消可不进行替换。若替换为动态迷彩，请确保原迷彩为动态迷彩，否则将显示为静态：若替换为静态迷彩，请确保原迷彩为静态迷彩，否则将发生系统错误） :",
		lastOriginalPaintChoice,
		paintsPattern,
		"输入无效，请输入有效的迷彩"
	);

	let newChoicePaint = getUserChoice(
		"请选择要使用的替换后迷彩（点击取消可不进行替换，若替换为动态迷彩，请确保原迷彩为动态迷彩，否则将显示为静态）:",
		lastNewPaintChoice,
		paintsPattern,
		"输入无效，请输入有效的迷彩"
	);

	const confirmationMessage = `
    您选择了：
    底盘 ${userChoiceHull ? userChoiceHull.toUpperCase() : '不替换'}
    炮塔 ${userChoiceTurret ? userChoiceTurret.toUpperCase() : '不替换'}
    无人机 ${userChoiceDrone ? userChoiceDrone.toUpperCase() : '不替换'}
    节日 ${userChoiceFestival ? userChoiceFestival.toUpperCase() : '不替换'}
    射击效果 ${userChoiceShotEffect ? userChoiceShotEffect.toUpperCase() : '不替换'}
    迷彩 ${originalChoicePaint ? originalChoicePaint.toUpperCase() : '不替换'} → ${newChoicePaint ? newChoicePaint.toUpperCase() : '不替换'}。
    点击确定继续。`;
	if (confirm(confirmationMessage)) {
		localStorage.setItem('userChoiceHull', userChoiceHull);
		localStorage.setItem('userChoiceTurret', userChoiceTurret);
		localStorage.setItem('userChoiceDrone', userChoiceDrone);
		localStorage.setItem('userChoiceFestival', userChoiceFestival);
		localStorage.setItem('userChoiceShotEffect', userChoiceShotEffect);
		localStorage.setItem('originalChoicePaint', originalChoicePaint);
		localStorage.setItem('newChoicePaint', newChoicePaint);

		function replaceResources(redirectMap, userChoice) {
			if (userChoice && redirectMap[userChoice]) {
				const map = redirectMap;
				document.querySelectorAll('script, link, img, audio, video, source').forEach(tag => {
					for (const key in map) {
						if (tag.src && tag.src.includes(map[key].default)) {
							const newSrc = map[key][userChoice];
							if (newSrc) {
								tag.src = tag.src.replace(map[key].default, newSrc);
							}
						}
						if (tag.href && tag.href.includes(map[key].default)) {
							const newHref = map[key][userChoice];
							if (newHref) {
								tag.href = tag.href.replace(map[key].default, newHref);
							}
						}
					}
				});
			}
		}

		replaceResources(hullsRedirectMap, userChoiceHull);
		replaceResources(turretsRedirectMap, userChoiceTurret);
		replaceResources(dronesRedirectMap, userChoiceDrone);
		replaceResources(festivalsRedirectMap, userChoiceFestival);
		replaceResources(shotEffectsRedirectMap, userChoiceShotEffect);

		if (originalChoicePaint && paintsRedirectMap[originalChoicePaint] && newChoicePaint && paintsRedirectMap[newChoicePaint]) {
			const paintMap = paintsRedirectMap;
			document.querySelectorAll('script, link, img, audio, video, source').forEach(tag => {
				for (const key in paintMap) {
					if (tag.src && tag.src.includes(paintMap[key][originalChoicePaint])) {
						const oldSrc = paintMap[key][originalChoicePaint];
						const newSrc = paintMap[key][newChoicePaint];
						if (newSrc) {
							tag.src = tag.src.replace(oldSrc, newSrc);
						}
					}
					if (tag.href && tag.href.includes(paintMap[key][originalChoicePaint])) {
						const oldHref = paintMap[key][originalChoicePaint];
						const newHref = paintMap[key][newChoicePaint];
						if (newHref) {
							tag.href = tag.href.replace(oldHref, newHref);
						}
					}
				}
			});
		}

		const originalFetch = window.fetch;
		window.fetch = function(input, init) {
			if (typeof input === 'string') {
				function replaceInputResource(input, redirectMap, userChoice) {
					const choiceKey = userChoice.toUpperCase();
					for (const key in redirectMap) {
						if (input.includes(redirectMap[key].default) && redirectMap[key][choiceKey]) {
							input = input.replace(redirectMap[key].default, redirectMap[key][choiceKey]);
							break;
						}
					}
					return input;
				}

				input = replaceInputResource(input, hullsRedirectMap, userChoiceHull);
				input = replaceInputResource(input, turretsRedirectMap, userChoiceTurret);
				input = replaceInputResource(input, dronesRedirectMap, userChoiceDrone);
				input = replaceInputResource(input, festivalsRedirectMap, userChoiceFestival);
				input = replaceInputResource(input, shotEffectsRedirectMap, userChoiceShotEffect);

				for (const key in paintsRedirectMap) {
					if (input.includes(paintsRedirectMap[key][originalChoicePaint.toUpperCase()]) && paintsRedirectMap[key][newChoicePaint.toUpperCase()]) {
						input = input.replace(paintsRedirectMap[key][originalChoicePaint.toUpperCase()], paintsRedirectMap[key][newChoicePaint.toUpperCase()]);
						break;
					}
				}
			}
			return originalFetch(input, init);
		};

		const originalOpen = XMLHttpRequest.prototype.open;
		XMLHttpRequest.prototype.open = function(method, url) {
			function replaceUrlResource(url, redirectMap, userChoice) {
				const choiceKey = userChoice.toUpperCase();
				for (const key in redirectMap) {
					if (url.includes(redirectMap[key].default) && redirectMap[key][choiceKey]) {
						url = url.replace(redirectMap[key].default, redirectMap[key][choiceKey]);
						break; // 找到第一个匹配后就停止替换
					}
				}
				return url;
			}

			url = replaceUrlResource(url, hullsRedirectMap, userChoiceHull);
			url = replaceUrlResource(url, turretsRedirectMap, userChoiceTurret);
			url = replaceUrlResource(url, dronesRedirectMap, userChoiceDrone);
			url = replaceUrlResource(url, festivalsRedirectMap, userChoiceFestival);
			url = replaceUrlResource(url, shotEffectsRedirectMap, userChoiceShotEffect);

			for (const key in paintsRedirectMap) {
				if (url.includes(paintsRedirectMap[key][originalChoicePaint.toUpperCase()]) && paintsRedirectMap[key][newChoicePaint.toUpperCase()]) {
					url = url.replace(paintsRedirectMap[key][originalChoicePaint.toUpperCase()], paintsRedirectMap[key][newChoicePaint.toUpperCase()]);
					break;
				}
			}
			originalOpen.call(this, method, url);
		};

	} else {
		alert("选择已取消，页面将继续加载原始内容。");
	}
})();
